# Python Pandas DataFrame

In [1]:
import pandas as pd

In [2]:
em_df=pd.DataFrame()
print(em_df)

Empty DataFrame
Columns: []
Index: []

In [3]:
lst=['a','b','c']
lst

['a', 'b', 'c']

In [4]:
df1=pd.DataFrame(lst)
print(df1)

   0
0  a
1  b
2  c

In [5]:
df1

   0
0  a
1  b
2  c

In [6]:
ls_s=[[1,2,3],[4,5,6],[7,8,9]]
print(ls_s)

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [7]:
df2=pd.DataFrame(ls_s)
df2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
ls_s=[[1,2,3],[4,5],[7,8,9]]
df2=pd.DataFrame(ls_s)
df2

   0  1    2
0  1  2  3.0
1  4  5  NaN
2  7  8  9.0

In [9]:
dict1={'id': [11,22,33,44]}
dict1

{'id': [11, 22, 33, 44]}

In [10]:
df3=pd.DataFrame(dict1)
df3

   id
0  11
1  22
2  33
3  44

In [11]:
dict2={'id':[1,2,3],'sk':[4,5,6]}
dict2

{'id': [1, 2, 3], 'sk': [4, 5, 6]}

In [12]:
df4=pd.DataFrame(dict2)
df4

   id  sk
0   1   4
1   2   5
2   3   6

In [13]:
ls_dict=[{'a':1,'b':2},{'a':3,'b':4}]
ls_dict

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [14]:
df5=pd.DataFrame(ls_dict)
df5

   a  b
0  1  2
1  3  4

In [15]:
ls_dict=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]
ls_dict

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4, 'c': 5}]

In [16]:
df5=pd.DataFrame(ls_dict)
df5

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [17]:
dict_serie={'id':pd.Series([1,2,3]),'sk':pd.Series([111,222,333])}
print(dict_serie)

{'id': 0    1
1    2
2    3
dtype: int64, 'sk': 0    111
1    222
2    333
dtype: int64}

In [18]:
df6=pd.DataFrame(dict_serie)
df6

   id   sk
0   1  111
1   2  222
2   3  333